app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        @item = Item.all

INSERT INTO "items" ("image", "created_at", "updated_at", "child_id") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "items" ("created_at", "updated_at", "child_id", "file") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        puts params
        if params[:image]
            image = Cloudinary::Uploader.upload(params[:image])
            item = Item.create(image: image["secure_url"], child_id: params["child_id"])
            render json: item
        end
        if params[:file]
            file = Cloudinary::Uploader.upload(params[:file])
            item = Item.create(file: file["secure_url"], child_id: params["child_id"])

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 11]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def destroy
        Item.find(params[:id]).destroy