app/controllers/messageboards_controller.rb

SELECT "messageboards".* FROM "messageboards"
---
  def index
    @messageboards = Messageboard.all