app/controllers/registrations_controller.rb

    def create
        user = User.create!(
            email: params['user']['email'],
            password: params['user']['password'],
            password_confirmation: params['user']['password_confirmation']
        )
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def update
        p User.find(params[:id])
        user = User.find(params[:id])
        user.update(
            email: params['user']['email'],
            password: params['user']['password'],
            password_confirmation: params['user']['password_confirmation']
        )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$ddFp6trZfsk3bfwTQUF2z.xt28J8kZPMHHQ0BSsv8h5FwY2BTJ56e"], ["updated_at", "2020-08-01 16:30:50.973756"], ["id", 1]]