app/controllers/concerns/current_user_concern.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_current_user
        if session[:user_id]
            @current_user = User.find(session[:user_id])